#include <iostream>



using namespace std;
//---------------------Функции и Прототипы---------------------------------------





//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");
	
	//-------------------------------САМА ПРОГА-------------------------------------

	char a;
		//char b = '0';

	cout << "Введите букву в нижнем регистре:  ";
	cin >> a;

	//b =  (int)a - 32;

	
	cout << endl << "Ваша буква в ВЕРХНЕМ регистре:  " << (char)((int)a - 32) << endl << endl;








	return 0;
}
